RSN/src/InformationRegisters/НастройкиИБИОбменов/НастройкиИБИОбменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИБИОбменов</name>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПараметрыЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Обмен</name>
    <type>
      <types>CatalogRef.ОбменыДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БазаДанныхДляОбмена</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/Enums/КонфигурацииИнформационныхБаз/КонфигурацииИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонфигурацииИнформационныхБаз</name>
  <enumValues>
    <name>Бухгалтерия</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>Документооборот</name>
  </enumValues>
  <enumValues>
    <name>УправлениеХолдингом</name>
  </enumValues>
  <enumValues>
    <name>БухгалтерияБИТ</name>
  </enumValues>
  <enumValues>
    <name>ГорнодобывающаяПромышленность</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Enums/Среда/Среда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Среда</name>
  <enumValues>
    <name>Prod</name>
  </enumValues>
  <enumValues>
    <name>Test</name>
  </enumValues>
  <enumValues>
    <name>Dev</name>
  </enumValues>
  <enumValues>
    <name>Stage</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>СерверПриложений</name>
    <type>
      <types>CatalogRef.СерверПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьНаВебСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>EnumRef.КонфигурацииИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Среда</name>
    <type>
      <types>EnumRef.Среда</types>
    </type>
  </attributes>
  <attributes>
    <name>Контур</name>
    <type>
      <types>CatalogRef.Контур</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/Catalogs/ОбменыДанных/ОбменыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбменыДанных</name>
  <predefined>
    <items>
      <name>РезультатыОбменаБазДанных</name>
      <description>Результаты обмена баз дан</description>
    </items>
  </predefined>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданныхИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикРезультата</name>
    <type>
      <types>CatalogRef.ОбработчикиРезультатовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиРассылки</name>
    <type>
      <types>CatalogRef.НастройкиРассылки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчищатьОчередь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьСписокБаз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АдресаРассылок</name>
    <attributes>
      <name>ЭлектронныйАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоОшибки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/Catalogs/ОбъектыМетаданныхИнформационныхБаз/ОбъектыМетаданныхИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыМетаданныхИнформационныхБаз</name>
  <owners>Catalog.ВидыМетаданных</owners>
  <attributes>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВСервисе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИменаРеквизитовТипаДата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПриЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/CommonModules/Интеграция/Module.bsl
#Область ПрограммныйИнтерфейс 

// Вызывает метод ping веб-сервиса интеграции um 
//
// Параметры:
//  ПутьКБазеНаВебСервере - Строка - "ИмяСервера/ИмяБазыНаВебСервере". 
//	ДополнительныеПараметры - Структура - параметры подключения к сервису, см. КоннекторHTTP.НовыеПараметры
//
// Возвращаемое значение:
//	Признак доступности сервиса - булево
//
Функция ПроверитьДоступностьВебСервиса(ПутьКБазеНаВебСервере, ДополнительныеПараметры) Экспорт
	
	Ответ = ОбратитьсяКВебСервису(ПутьКБазеНаВебСервере, "GET", "ping", ДополнительныеПараметры);
	
	Если ТипЗнч(Ответ) = Тип("Структура") И Ответ.Свойство("error") И Ответ.error Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка при подключении по адресу " + ПутьКБазеНаВебСервере + Символы.ПС + Ответ.message);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина 
	
КонецФункции 

// Вызывает метод ping веб-сервиса интеграции um 
//
// Параметры:
//  ПутьКБазеНаВебСервере - Строка - "ИмяСервера/ИмяБазыНаВебСервере".
//  ВидЗапроса - Строка - Имя http-метода. "GET", "POST" и т.д.
//	ДополнительныеПараметры - Структура - параметры подключения к сервису, см. КоннекторHTTP.НовыеПараметры
//  ПараметрыЗапроса - Структура - Произвольные параметры запроса.
//
// Возвращаемое значение:
//	Ответ от веб сервиса - Структура или массив в зависимости от запроса
//
Функция ОбратитьсяКВебСервису(ПутьКБазеНаВебСервере, ВидЗапроса, ИмяМетода, ДополнительныеПараметры, ПараметрыЗапроса = Неопределено) Экспорт 
	
	URL = ПутьКБазеНаВебСервере + "/hs/um/" + ИмяМетода;
	
	Если Врег(ВидЗапроса) = "GET" Тогда
		Возврат КоннекторHTTP.GetJson(URL, ПараметрыЗапроса, ДополнительныеПараметры);
	ИначеЕсли Врег(ВидЗапроса) = "POST" Тогда
		Возврат КоннекторHTTP.PostJson(URL, ПараметрыЗапроса, ДополнительныеПараметры);
	ИначеЕсли Врег(ВидЗапроса) = "PUT" Тогда
		Возврат КоннекторHTTP.PutJson(URL, ПараметрыЗапроса, ДополнительныеПараметры);
	Иначе
		ВызватьИсключение "Не определен обработчик для обращения к сервису методом " + ВидЗапроса;
	КонецЕсли;  	
	
КонецФункции	

// Регистрирует объект метаданных в базе-корреспонденте для возможности интеграции через веб-сервис
//
// Параметры:
//  ПутьКБазеНаВебСервере - Строка - "ИмяСервера/ИмяБазыНаВебСервере"
//	ДополнительныеПараметры - Структура - параметры подключения к сервису, см. КоннекторHTTP.НовыеПараметры
//  ПараметрыРегистрации - см. ПараметрыРегистрацииОбъектаМетаданных  
//
Процедура ЗарегистрироватьОбъектМетаданных(ПутьКБазеНаВебСервере, ДополнительныеПараметры, ПараметрыРегистрации) Экспорт
	
	Ответ = ОбратитьсяКВебСервису(ПутьКБазеНаВебСервере, "POST", "metadata", ДополнительныеПараметры, ПараметрыРегистрации);
	
	Если ТипЗнч(Ответ) = Тип("Структура") И Ответ.Свойство("error") И Ответ.error Тогда
		ВызватьИсключение "Ошибка при регистрации объекта метаданных по адресу " + ПутьКБазеНаВебСервере + Символы.ПС + Ответ.message;
	КонецЕсли;
	
КонецПроцедуры      

Функция ПолучитьАвторизациюИзСоответствия(СоответствиеАвторизаций, Конфигурация, ЗначениеПоУмолчанию) Экспорт
	Аутентификация 	= ЗначениеПоУмолчанию;	
	Массив 			= СоответствиеАвторизаций.Получить(Конфигурация);
	Если Массив = Неопределено Тогда  
		Массив = СоответствиеАвторизаций.Получить(ПредопределенноеЗначение("Перечисление.КонфигурацииИнформационныхБаз.ПустаяСсылка")); 
		Если Массив = Неопределено = Ложь Тогда 
			Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", Массив[0].ИмяПользователя, Массив[0].Пароль));	
		КонецЕсли;
	Иначе 
		Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", Массив[0].ИмяПользователя, Массив[0].Пароль));	
	КонецЕсли;  
	Возврат Аутентификация;
КонецФункции

#КонецОбласти                

#Область СлужебныйПрограммныйИнтерфейс  

#Область РегламентныеЗадания

Процедура РегистрацияОсновныхОбъектовДляРаботыССервисом() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.РегистрацияОсновныхОбъектов);
	
	Если Не ОбщегоНазначенияCDMПовтИсп.ЭтоРабочаяБаза() Тогда
		Возврат
	КонецЕсли;
	
	СписокБаз = Новый Массив; 
	ЕстьОшибки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформационныеБазы.Конфигурация КАК Конфигурация,
		|	ИнформационныеБазы.Ссылка КАК ИБ,
		|	ИнформационныеБазы.ПутьНаВебСервере КАК ПутьНаВебСервере
		|ПОМЕСТИТЬ БазыДляОбработки
		|ИЗ
		|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
		|ГДЕ
		|	ИнформационныеБазы.Среда = &Среда
		|	И НЕ ИнформационныеБазы.Тестовая
		|	И НЕ ИнформационныеБазы.ПометкаУдаления
		|	И НЕ ИнформационныеБазы.ПутьНаВебСервере = """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БазыДляОбработки.ПутьНаВебСервере КАК ПутьНаВебСервере,
		|	БазыДляОбработки.Конфигурация КАК Конфигурация
		|ИЗ
		|	БазыДляОбработки КАК БазыДляОбработки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрофилиГруппДоступаИнформационныхБаз.Ссылка КАК Профиль
		|ИЗ
		|	Справочник.ПрофилиГруппДоступаИнформационныхБаз КАК ПрофилиГруппДоступаИнформационныхБаз
		|ГДЕ
		|	ПрофилиГруппДоступаИнформационныхБаз.Владелец В
		|			(ВЫБРАТЬ
		|				БазыДляОбработки.ИБ КАК ИБ
		|			ИЗ
		|				БазыДляОбработки КАК БазыДляОбработки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбменыДанных.Ссылка КАК Обработчик
		|ИЗ
		|	Справочник.ОбменыДанных КАК ОбменыДанных
		|ГДЕ
		|	НЕ ОбменыДанных.ПометкаУдаления
		|	И ОбменыДанных.ВыполнятьПоРасписанию
		|	И ОбменыДанных.ОбновлятьСписокБаз";
	
	Запрос.УстановитьПараметр("Среда", Перечисления.Среда.Prod);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	БазыДляОбработки = ПакетЗапросов[1].Выбрать(); 
	Пока БазыДляОбработки.Следующий() Цикл
		СписокБаз.Добавить(Новый Структура("ПутьНаВебСервере,Конфигурация", БазыДляОбработки.ПутьНаВебСервере, БазыДляОбработки.Конфигурация));		
	КонецЦикла;
	Справочники.ИнформационныеБазы.ЗарегистрироватьОсновныеОбъекты(СписокБаз, , ЕстьОшибки); 
	
	ПрофилиДоступа = ПакетЗапросов[2].Выгрузить().ВыгрузитьКолонку("Профиль");	
	Справочники.ПрофилиГруппДоступаИнформационныхБаз.ЗаполнитьПрофили(ПрофилиДоступа);
	
	Обработчики = ПакетЗапросов[3].Выбрать();
	Пока Обработчики.Следующий() Цикл
		РегистрыСведений.НастройкиИБИОбменов.ДополнитьСписокПродуктивнымиБазами(Обработчики.Обработчик)
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти

Процедура ЗаполнитьТекстыДопОбработчиков(ПараметрыРегистрации, Конфигурация, ИмяОбъекта) Экспорт
	
	ТекстОбработчика = ""; 
	
	Если ИмяОбъекта = "Справочник.Пользователи" Тогда 
		
		Если Не Конфигурация = Перечисления.КонфигурацииИнформационныхБаз.Документооборот Тогда
			
			ПараметрыРегистрации.Вставить("beforewright",
			"РезвизитыДляДопОбработки = РеквизитыЗапроса.ДопОбработчики[ВидОбработчика];
			|
			|Если РезвизитыДляДопОбработки.Свойство(""АдресЭлектроннойПочты"") Тогда   
			|		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбрабатываемыйОбъект, 
			|			РезвизитыДляДопОбработки.АдресЭлектроннойПочты, 
			|				Справочники.ВидыКонтактнойИнформации.EmailПользователя, Дата(""19800101"")); 
			|КонецЕсли");
				
			ПараметрыРегистрации.Вставить("atwright",  
			"РезвизитыДляДопОбработки = РеквизитыЗапроса.ДопОбработчики[ВидОбработчика];
			|Если РезвизитыДляДопОбработки.Свойство(""Профили"") Тогда         		
			|	
			|	Запрос = Новый Запрос;
			|	Запрос.Текст = 
			|	""ВЫБРАТЬ
			||		ГруппыДоступаПользователи.Ссылка КАК Ссылка,
			||		ГруппыДоступаПользователи.НомерСтроки КАК НомерСтроки
			||	ИЗ
			||		Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
			||	ГДЕ
			||		ГруппыДоступаПользователи.Пользователь = НЕОПРЕДЕЛЕНО
			||		И ГруппыДоступаПользователи.Пользователь = &Пользователь"";
			|
			|	Запрос.УстановитьПараметр(""Пользователь"", ОбрабатываемыйОбъект.Ссылка); 
			|	Выборка = Запрос.Выполнить().Выбрать();
			|
			|	Пока Выборка.Следующий() Цикл
			|		ТекГруппа = Выборка.Ссылка.ПолучитьОбъект();
			|		ТекГруппа.Пользователи.Удалить(Выборка.НомерСтроки); 
			|		ТекГруппа.Записать();
			|	КонецЦикла;
			|	
			|	МассивПрофили = РезвизитыДляДопОбработки.Профили;
			|	ТекПользователь = ОбрабатываемыйОбъект.Ссылка;
			|	Для Каждого ИмяПрофиля Из МассивПрофили Цикл
			|		
			|       ТекПрофиль = Справочники.ПрофилиГруппДоступа.НайтиПоНаименованию(ИмяПрофиля,Истина);
			|		Если УправлениеДоступомСлужебный.УпрощенныйИнтерфейсНастройкиПравДоступа() Тогда
			|			Если Не ЗначениеЗаполнено(ТекПрофиль) Тогда   			
			|				ВызватьИсключение ""Не удалось определить профиль групп доступа по наименованию: "" + ИмяПрофиля;
			|			КонецЕсли;
			|			УправлениеДоступом.ВключитьПрофильПользователю(ТекПользователь, ТекПрофиль);
			|		Иначе
			|			ТекГруппа = Справочники.ГруппыДоступа.НайтиПоНаименованию(ИмяПрофиля, Истина); 
			|			Если Не ЗначениеЗаполнено(ТекГруппа) Тогда   			
			|				ВызватьИсключение ""Не удалось определить группу доступа по наименованию: "" + ИмяПрофиля;
			|			КонецЕсли;
			|			
			|			ГруппаДоступаОбъект = ТекГруппа.ПолучитьОбъект();
			|			ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = ТекПользователь;
			|			ГруппаДоступаОбъект.Записать();
			|		КонецЕсли;
			|	КонецЦикла;
			|КонецЕсли;");
		КонецЕсли; 
		
	ИначеЕсли ИмяОбъекта = "Обработка.АктивныеПользователи" Тогда
		
		ПараметрыРегистрации.Вставить("request",
		"Запрос = Новый Запрос;
		|
		|Если УправлениеДоступомСлужебный.УпрощенныйИнтерфейсНастройкиПравДоступа() Тогда
		|
		|Запрос.Текст = 
		|""ВЫБРАТЬ РАЗЛИЧНЫЕ
		||	Профили.Ссылка.Наименование КАК ИмяПрофиля
		||ИЗ
		||	Справочник.ПрофилиГруппДоступа КАК Профили
		||		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		||		ПО Профили.Ссылка = ГруппыДоступа.Профиль
		||			И (НЕ(ГруппыДоступа.Пользователь <> &Пользователь
		||					И Профили.Ссылка <> &ПрофильАдминистратор))
		||		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		||		ПО (ГруппыДоступа.Ссылка = ГруппыДоступаПользователи.Ссылка)
		||			И (ГруппыДоступаПользователи.Пользователь = &Пользователь)
		||ГДЕ
		||	НЕ Профили.ПометкаУдаления
		||	И НЕ Профили.ЭтоГруппа
		||	И ВЫБОР
		||			КОГДА ГруппыДоступаПользователи.Ссылка ЕСТЬ NULL
		||				ТОГДА ЛОЖЬ
		||			ИНАЧЕ ИСТИНА
		||		КОНЕЦ"";
		|
		|Иначе
		|
		|Запрос.Текст =
		|""ВЫБРАТЬ
		||	ГруппыДоступаПользователи.Ссылка.Наименование КАК ИмяПрофиля
		||ИЗ
		||	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		||ГДЕ
		||	ГруппыДоступаПользователи.Пользователь = &Пользователь
		||	И НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления"";		
		|
		|КонецЕсли;
		|Запрос.УстановитьПараметр(""Пользователь"", Справочники.Пользователи.НайтиПоНаименованию(ПараметрыЗапроса.Получить(""ИмяПользователя"")));
		|Запрос.УстановитьПараметр(""ПрофильАдминистратор"", Справочники.ПрофилиГруппДоступа.НайтиПоНаименованию(""Администратор"", Истина));
		|
		|РезультатЗапроса = Запрос.Выполнить();	
		|Выборка = РезультатЗапроса.Выбрать();    
		|
		|Результат = Новый Массив;
		|Пока Выборка.Следующий() Цикл
		|	Результат.Добавить(Выборка.ИмяПрофиля);	
		|КонецЦикла;");  
		
	ИначеЕсли ИмяОбъекта = "Справочник.ДополнительныеОтчетыИОбработки" Тогда //УдалитьФрагмент удаления из регистра НазначениеДополнительныхОбработок
		
		ПараметрыРегистрации.Вставить("beforewright",
			"Если Не ОбрабатываемыйОбъект.ЭтоНовый() Тогда
			|	ОбрабатываемыйОбъект.Команды.Очистить();
			|	Для каждого Стр Из ОбрабатываемыйОбъект.Ссылка.Команды Цикл
			|		ЗаполнитьЗначенияСвойств(ОбрабатываемыйОбъект.Команды.Добавить(), Стр); 	
			|	КонецЦикла;
			|КонецЕсли;
			|
			|Если Не ЗначениеЗаполнено(ОбрабатываемыйОбъект.Ответственный) Тогда
			|	ОбрабатываемыйОбъект.Ответственный = Пользователи.ТекущийПользователь();
			|КонецЕсли;
			|  
			|ОбрабатываемыйОбъект.Назначение.Очистить();
			|Для Каждого Стр Из РеквизитыЗапроса.Назначение Цикл 
			| 	 ОбъектНазначения = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию(Стр.ОбъектНазначенияПредставление);
			|  	 Если Не ОбъектНазначения.Пустая() Тогда
			|  		 ЗаполнитьЗначенияСвойств(ОбрабатываемыйОбъект.Назначение.Добавить(), Новый Структура(""ОбъектНазначения"", ОбъектНазначения));	
			|  	 КонецЕсли;
			|КонецЦикла;		
			|
			|ОбрабатываемыйОбъект.Разделы.Очистить();
			|Для Каждого Стр Из РеквизитыЗапроса.Разделы Цикл 
			|  	 Раздел = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию(Стр.РазделПредставление);
			|  	 Если Не Раздел.Пустая() Тогда
			|  		 ЗаполнитьЗначенияСвойств(ОбрабатываемыйОбъект.Разделы.Добавить(), Новый Структура(""Раздел"", Раздел));	
			|  	 КонецЕсли;
			|КонецЦикла;  
			|
			|ОбновитьПовторноИспользуемыеЗначения();");  
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыРегистрацииИзБазы(ВидМетаданных, ПредставлениеВСервисе) Экспорт
	
	ПараметрыРегистрации = Интеграция.НовыйПараметрыРегистрацииОбъектаМетаданных();
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Владелец", ВидМетаданных);
	Запрос.УстановитьПараметр("ПредставлениеВСервисе", ПредставлениеВСервисе);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыМетаданныхИнформационныхБаз.Владелец.Код КАК ВладелецКод,
		|	ОбъектыМетаданныхИнформационныхБаз.Владелец.Наименование КАК ВладелецНаименование,
		|	ОбъектыМетаданныхИнформационныхБаз.ИмяОбъекта КАК ИмяОбъекта,
		|	ОбъектыМетаданныхИнформационныхБаз.ПредставлениеВСервисе КАК ПредставлениеВСервисе,
		|	ОбъектыМетаданныхИнформационныхБаз.ТекстЗапроса КАК ТекстЗапроса,
		|	ОбъектыМетаданныхИнформационныхБаз.КлючПоиска КАК КлючПоиска,
		|	ОбъектыМетаданныхИнформационныхБаз.ОбработчикПередЗаписью КАК ОбработчикПередЗаписью,
		|	ОбъектыМетаданныхИнформационныхБаз.ОбработчикПриЗаписи КАК ОбработчикПриЗаписи
		|ИЗ
		|	Справочник.ОбъектыМетаданныхИнформационныхБаз КАК ОбъектыМетаданныхИнформационныхБаз
		|ГДЕ
		|	ОбъектыМетаданныхИнформационныхБаз.Владелец = &Владелец
		|	И ОбъектыМетаданныхИнформационныхБаз.ПредставлениеВСервисе = &ПредставлениеВСервисе";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		
		ВидОбъектаМетаданных = "";
		Если Выборка.ВладелецКод = "Catalogs" Или Выборка.ВладелецКод = "Documents" Тогда
			ВидОбъектаМетаданных = Лев(Выборка.ВладелецНаименование, СтрДлина(Выборка.ВладелецНаименование)-1);
		ИначеЕсли Выборка.ВладелецКод = "DataProcessings" Тогда
			ВидОбъектаМетаданных = "Обработка";
		Иначе
			ВидОбъектаМетаданных = СтрЗаменить(СтрЗаменить(Трег(Выборка.ВладелецНаименование), "ы", ""), " ", "");				
		КонецЕсли;  	
		
		ПараметрыРегистрации.fullname = ВидОбъектаМетаданных + "." + Выборка.ИмяОбъекта;
		ПараметрыРегистрации.parent = Выборка.ВладелецКод;
		ПараметрыРегистрации.name = Выборка.ПредставлениеВСервисе;
		ПараметрыРегистрации.request = Выборка.ТекстЗапроса;
		ПараметрыРегистрации.searchkey = Выборка.КлючПоиска;
		ПараметрыРегистрации.beforewright = Выборка.ОбработчикПередЗаписью;
		ПараметрыРегистрации.atwright = Выборка.ОбработчикПриЗаписи;
		
	КонецЕсли; 
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает параметры, необходимые для регистрации объекта метаданных (см. ЗарегистрироватьОбъектМетаданных)
//
//  Структура:
//    * fullname - Строка - Полное имя объекта метаданных в базе-корреспонденте. Например, "Справочник.Пользователи"
//    * parent   - Строка - Вид метаданных в справочнике "um_ОбъектыМетаданных" базы-корреспондента. Например, "Catalogs". 
//    						 "Желательные" имена родителей см. в расширении CDM, общий модуль "um_httpСервис" Метод "ВидыМетаданных".
//    * name     - Строка - Имя объекта метаданных в веб-сервисе. Для дальнеёшего обращения к нему методом "Get". Например, "Users".
//							Т.о., в приведенных примерах, после регистрации к справочнику "Пользователи" можно обратиться "Catalogs/Users".
//    * request  - Строка - Необязательный. Произвольный текст запроса к объекту метаданных. 
//
Функция НовыйПараметрыРегистрацииОбъектаМетаданных() Экспорт
	
	ПарметрыРегистрации = Новый Структура;
	ПарметрыРегистрации.Вставить("fullname", "");
	ПарметрыРегистрации.Вставить("parent", "");
	ПарметрыРегистрации.Вставить("name", "");
	ПарметрыРегистрации.Вставить("request", "");
	ПарметрыРегистрации.Вставить("beforewright", "");
	ПарметрыРегистрации.Вставить("atwright", "");
	ПарметрыРегистрации.Вставить("searchkey", "");
	
	Возврат ПарметрыРегистрации
	
КонецФункции

#КонецОбласти
